In [54]:
import pandas as pd
print(pd.__version__)

2.3.3

In [8]:
list1=[1,2,3,4,5]
ser=pd.Series(list1,index=['a','b','c','d','e'])
ser

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [121]:
data={
    "Name":["AD","AB","AC","AF","AM"],
    "Age":[28,36,24,23,21],
    "Salary":[2000,3000,4000,5000,6000]
}

df=pd.DataFrame(data)
df

  Name  Age  Salary
0   AD   28    2000
1   AB   36    3000
2   AC   24    4000
3   AF   23    5000
4   AM   21    6000

In [122]:
df.head(2)

  Name  Age  Salary
0   AD   28    2000
1   AB   36    3000

In [123]:
df.tail(2)

  Name  Age  Salary
3   AF   23    5000
4   AM   21    6000

In [124]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
 2   Salary  5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 252.0+ bytes

In [125]:
df.describe()

            Age      Salary
count   5.00000     5.00000
mean   26.40000  4000.00000
std     5.94138  1581.13883
min    21.00000  2000.00000
25%    23.00000  3000.00000
50%    24.00000  4000.00000
75%    28.00000  5000.00000
max    36.00000  6000.00000

In [126]:
df.shape

(5, 3)

In [127]:
df.columns

Index(['Name', 'Age', 'Salary'], dtype='object')

In [128]:
df.Age

0    28
1    36
2    24
3    23
4    21
Name: Age, dtype: int64

In [129]:
df.Name

0    AD
1    AB
2    AC
3    AF
4    AM
Name: Name, dtype: object

In [130]:
print(df[['Age','Name']])

   Age Name
0   28   AD
1   36   AB
2   24   AC
3   23   AF
4   21   AM

In [131]:
df.iloc[0]

Name        AD
Age         28
Salary    2000
Name: 0, dtype: object

In [132]:
df.iloc[1:3]

  Name  Age  Salary
1   AB   36    3000
2   AC   24    4000

In [133]:
df.loc[0:3,['Name','Age']]

  Name  Age
0   AD   28
1   AB   36
2   AC   24
3   AF   23

In [134]:
df['Tax']=df['Salary']*0.10
df

  Name  Age  Salary    Tax
0   AD   28    2000  200.0
1   AB   36    3000  300.0
2   AC   24    4000  400.0
3   AF   23    5000  500.0
4   AM   21    6000  600.0

In [135]:
df['Salary']=df['Salary']+1000
df

  Name  Age  Salary    Tax
0   AD   28    3000  200.0
1   AB   36    4000  300.0
2   AC   24    5000  400.0
3   AF   23    6000  500.0
4   AM   21    7000  600.0

In [136]:
df.drop('Tax',axis=1,inplace=True)
df

  Name  Age  Salary
0   AD   28    3000
1   AB   36    4000
2   AC   24    5000
3   AF   23    6000
4   AM   21    7000

In [137]:
df.loc[2,'Age']=None
df

  Name   Age  Salary
0   AD  28.0    3000
1   AB  36.0    4000
2   AC   NaN    5000
3   AF  23.0    6000
4   AM  21.0    7000

In [138]:
df.isna()

    Name    Age  Salary
0  False  False   False
1  False  False   False
2  False   True   False
3  False  False   False
4  False  False   False

In [139]:
df['Age']=df['Age'].fillna(df['Age'].mode())
df

  Name   Age  Salary
0   AD  28.0    3000
1   AB  36.0    4000
2   AC  28.0    5000
3   AF  23.0    6000
4   AM  21.0    7000

In [140]:
df.dropna()

  Name   Age  Salary
0   AD  28.0    3000
1   AB  36.0    4000
2   AC  28.0    5000
3   AF  23.0    6000
4   AM  21.0    7000

In [141]:
con1=df[df['Age']<30]
con1

  Name   Age  Salary
0   AD  28.0    3000
2   AC  28.0    5000
3   AF  23.0    6000
4   AM  21.0    7000

In [142]:
con2=df[(df['Age']<30) & (df['Salary']>4000)]
con2

  Name   Age  Salary
2   AC  28.0    5000
3   AF  23.0    6000
4   AM  21.0    7000

In [143]:
df.sort_values(by='Age',ascending=True)

  Name   Age  Salary
4   AM  21.0    7000
3   AF  23.0    6000
2   AC  28.0    5000
0   AD  28.0    3000
1   AB  36.0    4000

In [144]:
df.sort_values(by=['Age','Salary'], ascending=False)

  Name   Age  Salary
1   AB  36.0    4000
2   AC  28.0    5000
0   AD  28.0    3000
3   AF  23.0    6000
4   AM  21.0    7000

In [145]:
df['Ranking']=df['Age'].rank(ascending=False)
df

  Name   Age  Salary  Ranking
0   AD  28.0    3000      2.5
1   AB  36.0    4000      1.0
2   AC  28.0    5000      2.5
3   AF  23.0    6000      4.0
4   AM  21.0    7000      5.0

In [147]:
group1=df.groupby('Age')['Salary'].mean()
group1

Age
21.0    7000.0
23.0    6000.0
28.0    4000.0
36.0    4000.0
Name: Salary, dtype: float64

In [150]:
group2=df.groupby('Age').agg({'Salary':['mean','max','min']})
group2

      Salary
        mean   max   min
Age
21.0  7000.0  7000  7000
23.0  6000.0  6000  6000
28.0  4000.0  5000  3000
36.0  4000.0  4000  4000

In [153]:
dept_data=pd.DataFrame({
    "Name":["AD","AB","AC","AF","AM"],
    "Department":["HR","IT","Finance","IT","HR"]
})

merged=pd.merge(df,dept_data,on="Name")
merged

  Name   Age  Salary  Ranking Department
0   AD  28.0    3000      2.5         HR
1   AB  36.0    4000      1.0         IT
2   AC  28.0    5000      2.5    Finance
3   AF  23.0    6000      4.0         IT
4   AM  21.0    7000      5.0         HR

In [154]:
df1=df.head(2)
df2=df.tail(2)

combine=pd.concat([df1,df2])
combine

  Name   Age  Salary  Ranking
0   AD  28.0    3000      2.5
1   AB  36.0    4000      1.0
3   AF  23.0    6000      4.0
4   AM  21.0    7000      5.0

In [156]:
df['Salary'].mean()
df['Salary'].min()
df['Salary'].max()

np.int64(7000)

In [165]:
df['Joinning_Date']=pd.date_range(start='2020-01-01', periods=len(df), ferq='D')

df["Joinning_Year"]=df['Joinning_Date'].dt.year

df[["Name","Joinning_Date","Joinning_Year"]]

TypeError: DatetimeArray._generate_range() got an unexpected keyword argument 'ferq'

In [159]:
df.to_csv('Final_output.csv',index=False)

In [161]:
import os

path=os.getcwd()
print(path)

c:\Users\Admin\Desktop\Python Basics